### Database Handling with Python

In [1]:
# creation of a Database
# importing the required modules
import sqlite3
try:
    # use the database if it pre-exists or create a new one
    connection = sqlite3.connect("myemp.db")
    # as "myemp.db" is a databse file so extension .db has been provided
except exception as ex:
    print ("Error type ->", type(ex))
    print ("Error message ->", ex)
else:
    print ("Connection with the database has been completed successfully...")
print ("End of this section...")

Connection with the database has been completed successfully...
End of this section...

> Open the SQLite online manager from "https://extendsclass.com/sqlite-browser.html"

In [2]:
# create employee table as employee(emp_id, emp_name, emp_city, emp_salary)
sqlStr = """
         CREATE TABLE employee (
             emp_id INTEGER PRIMARY KEY,
             emp_name TEXT,
             emp_city TEXT,
             emp_salary REAL
         );
         """
try:    # create the table if it does not pre-exist
    connection.execute(sqlStr)
except exception as ex:
    print ("Error Type ->", type(ex))
    print ("Error message ->", ex)
else:
    print ("The table has been created successfully...")
print ("End of this section...")

The table has been created successfully...
End of this section...

In [11]:
# inserting records from the csv file and writing it to the database employee table
import csv
sqlStr = "INSERT INTO employee VALUES ('{emp_id}, {emp_name}, {emp_city}, {emp_salary}')"
# read lines from the csv file and store them into the database table
with open('emp_data.csv') as data_file:
    csv_reader = csv.reader(data_file)
    # reader is to read data from the csv file with , as a delimiter
    print (csv_reader)
    print (list(csv_reader))
    print (len(list(csv_reader)))

<_csv.reader object at 0x00000200B1B28E80>
[['1001', 'Dhiman', 'Kolkata', '39000'], ['1002', 'Anupam', 'Kolkata', '25000'], ['1003', 'Subham', 'Mumbai', '36000'], ['1004', 'Dinesh', 'Chennai', '28000'], ['1005', 'Kakali', 'Mumbai', '25000'], ['1006', 'Bimal', 'Hyderabad', '30000'], ['1007', 'Tarun', 'Chennai', '17000'], ['1008', 'Rittik', 'Durgapur', '45000'], ['1009', 'Barun', 'Hyderabad', '39000'], ['1010', 'Utpal', 'Lucknow', '20000']]
0

In [14]:
# inserting records from the csv file and writing it to the database employee table
import csv
sqlStr = "INSERT INTO employee VALUES ('{emp_id}', '{emp_name}', '{emp_city}', '{emp_salary}');"
# read lines from the csv file and store them into the database table
with open('emp_data.csv') as data_file:
    csv_reader = csv.reader(data_file)
    # reader is to read data from the csv file with , as a delimiter
    for row in csv_reader:
        print (row)
        connection.execute(sqlStr.format(emp_id=row[0], emp_name=row[1], emp_city=row[2], emp_salary=row[3]))
connection.commit()    # making the change permanent
print ("All records got inserted successfully into the employee table...")

['1001', 'Dhiman', 'Kolkata', '39000']
['1002', 'Anupam', 'Kolkata', '25000']
['1003', 'Subham', 'Mumbai', '36000']
['1004', 'Dinesh', 'Chennai', '28000']
['1005', 'Kakali', 'Mumbai', '25000']
['1006', 'Bimal', 'Hyderabad', '30000']
['1007', 'Tarun', 'Chennai', '17000']
['1008', 'Rittik', 'Durgapur', '45000']
['1009', 'Barun', 'Hyderabad', '39000']
['1010', 'Utpal', 'Lucknow', '20000']
All records got inserted successfully into the employee table...

In [5]:
num1 = 100
num2 = 20
result = num1 + num2
print(f"{num1} + {num2} = {result}")
print("{fn} + {sn} = {tot}".format(fn = num1, sn = num2, tot = result))

100 + 20 = 120
100 + 20 = 120

In [15]:
# retrieving records from the database table
# SQL for fetching all the records from the employee table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
print (list(cur_table))

[(1001, 'Dhiman', 'Kolkata', 39000.0), (1002, 'Anupam', 'Kolkata', 25000.0), (1003, 'Subham', 'Mumbai', 36000.0), (1004, 'Dinesh', 'Chennai', 28000.0), (1005, 'Kakali', 'Mumbai', 25000.0), (1006, 'Bimal', 'Hyderabad', 30000.0), (1007, 'Tarun', 'Chennai', 17000.0), (1008, 'Rittik', 'Durgapur', 45000.0), (1009, 'Barun', 'Hyderabad', 39000.0), (1010, 'Utpal', 'Lucknow', 20000.0)]

In [16]:
# retrieving records from the database table
# SQL for fetching all the records from the employee table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}...")

Emp-ID: 1001, Emp-Name: Dhiman, Emp-City: Kolkata, Emp-Salary: 39000.0...
Emp-ID: 1002, Emp-Name: Anupam, Emp-City: Kolkata, Emp-Salary: 25000.0...
Emp-ID: 1003, Emp-Name: Subham, Emp-City: Mumbai, Emp-Salary: 36000.0...
Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 28000.0...
Emp-ID: 1005, Emp-Name: Kakali, Emp-City: Mumbai, Emp-Salary: 25000.0...
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0...
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 17000.0...
Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0...
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0...
Emp-ID: 1010, Emp-Name: Utpal, Emp-City: Lucknow, Emp-Salary: 20000.0...

In [18]:
# Class Assignment - 1
# Fetch employee_name, salary and 10% TDS against salaries of all employees.
sqlStr = "SELECT emp_name, emp_salary, emp_salary * 0.10 from employee"
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-Name: {row[0]}, Emp-Salary: {row[1]} and Emp-TDS: {row[2]}...")
print ("End of this section...")

Emp-Name: Dhiman, Emp-Salary: 39000.0 and Emp-TDS: 3900.0...
Emp-Name: Anupam, Emp-Salary: 25000.0 and Emp-TDS: 2500.0...
Emp-Name: Subham, Emp-Salary: 36000.0 and Emp-TDS: 3600.0...
Emp-Name: Dinesh, Emp-Salary: 28000.0 and Emp-TDS: 2800.0...
Emp-Name: Kakali, Emp-Salary: 25000.0 and Emp-TDS: 2500.0...
Emp-Name: Bimal, Emp-Salary: 30000.0 and Emp-TDS: 3000.0...
Emp-Name: Tarun, Emp-Salary: 17000.0 and Emp-TDS: 1700.0...
Emp-Name: Rittik, Emp-Salary: 45000.0 and Emp-TDS: 4500.0...
Emp-Name: Barun, Emp-Salary: 39000.0 and Emp-TDS: 3900.0...
Emp-Name: Utpal, Emp-Salary: 20000.0 and Emp-TDS: 2000.0...
End of this section...

In [20]:
# Class Assignment - 2
# Display city wise total, average, maximum and minimum salaries of all employees
sqlStr = """
         SELECT emp_city, COUNT(emp_salary), SUM(emp_salary), 
         AVG(emp_salary), MAX(emp_salary), MIN(emp_salary) 
         FROM employee
         GROUP BY emp_city;
         """
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"City: {row[0]}, Count: {row[1]}, Total: {row[2]}, Average: {row[3]}, Maximum: {row[4]}, Minimum: {row[5]}...")
print ("End of this section...")

City: Chennai, Count: 2, Total: 45000.0, Average: 22500.0, Maximum: 28000.0, Minimum: 17000.0...
City: Durgapur, Count: 1, Total: 45000.0, Average: 45000.0, Maximum: 45000.0, Minimum: 45000.0...
City: Hyderabad, Count: 2, Total: 69000.0, Average: 34500.0, Maximum: 39000.0, Minimum: 30000.0...
City: Kolkata, Count: 2, Total: 64000.0, Average: 32000.0, Maximum: 39000.0, Minimum: 25000.0...
City: Lucknow, Count: 1, Total: 20000.0, Average: 20000.0, Maximum: 20000.0, Minimum: 20000.0...
City: Mumbai, Count: 2, Total: 61000.0, Average: 30500.0, Maximum: 36000.0, Minimum: 25000.0...
End of this section...

In [30]:
# Class Assignment - 3
# Take n number of record inputs from the user and insert them into the employee table
sqlStr = "SELECT max(emp_id) FROM employee;"
cur_table = connection.execute(sqlStr)
new_emp_id = list(cur_table)[0][0] + 1
print (new_emp_id)
sqlStr = "INSERT INTO employee VALUES ('{emp_id}', '{emp_name}', '{emp_city}', '{emp_salary}');"
n = int(input("Please enter the number of new records: "))
for row_no in range(n):
    new_emp_name = input("Please enter employee name: ")
    new_emp_city = input("Please enter employee city: ")
    new_emp_salary = int(input("Please enter employee salary: "))
    connection.execute(sqlStr.format(emp_id=new_emp_id, emp_name=new_emp_name, emp_city=new_emp_city,
                                     emp_salary=new_emp_salary))
    new_emp_id += 1
connection.commit()    # making the change permanent
print ("All the new records got inserted successfully into the employee table...")

1012

Please enter the number of new records:  2
Please enter employee name:  Chandan
Please enter employee city:  Gujrat
Please enter employee salary:  45000
Please enter employee name:  Sima
Please enter employee city:  Kolkata
Please enter employee salary:  42000

All the new records got inserted successfully into the employee table...

In [31]:
# retrieving records from the database table
# SQL for fetching all the records from the employee table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}...")

Emp-ID: 1001, Emp-Name: Dhiman, Emp-City: Kolkata, Emp-Salary: 39000.0...
Emp-ID: 1002, Emp-Name: Anupam, Emp-City: Kolkata, Emp-Salary: 25000.0...
Emp-ID: 1003, Emp-Name: Subham, Emp-City: Mumbai, Emp-Salary: 36000.0...
Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 28000.0...
Emp-ID: 1005, Emp-Name: Kakali, Emp-City: Mumbai, Emp-Salary: 25000.0...
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0...
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 17000.0...
Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0...
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0...
Emp-ID: 1010, Emp-Name: Utpal, Emp-City: Lucknow, Emp-Salary: 20000.0...
Emp-ID: 1011, Emp-Name: Rohit, Emp-City: Noida, Emp-Salary: 35000.0...
Emp-ID: 1012, Emp-Name: Chandan, Emp-City: Gujrat, Emp-Salary: 45000.0...
Emp-ID: 1013, Emp-Name: Sima, Emp-City: Kolkata, Emp-Salary: 42000.0...

In [38]:
# Class Assignment - 4
# Transfer all the records from the employee database table to a Pandas DataFrame
import pandas as pd
sqlStr = "SELECT * FROM employee;"
df = pd.read_sql_query(sqlStr, connection)
df

    emp_id emp_name   emp_city  emp_salary
0     1001   Dhiman    Kolkata     39000.0
1     1002   Anupam    Kolkata     25000.0
2     1003   Subham     Mumbai     36000.0
3     1004   Dinesh    Chennai     28000.0
4     1005   Kakali     Mumbai     25000.0
5     1006    Bimal  Hyderabad     30000.0
6     1007    Tarun    Chennai     17000.0
7     1008   Rittik   Durgapur     45000.0
8     1009    Barun  Hyderabad     39000.0
9     1010    Utpal    Lucknow     20000.0
10    1011    Rohit      Noida     35000.0
11    1012  Chandan     Gujrat     45000.0
12    1013     Sima    Kolkata     42000.0

In [39]:
sqlStr = "SELECT * FROM employee;"
cur_table = connection.execute(sqlStr)
column_names = ["Emp_id", "Emp_Name", "Emp_City", "Emp_Salary"]
df = pd.DataFrame(data = cur_table, columns = column_names)
df

    Emp_id Emp_Name   Emp_City  Emp_Salary
0     1001   Dhiman    Kolkata     39000.0
1     1002   Anupam    Kolkata     25000.0
2     1003   Subham     Mumbai     36000.0
3     1004   Dinesh    Chennai     28000.0
4     1005   Kakali     Mumbai     25000.0
5     1006    Bimal  Hyderabad     30000.0
6     1007    Tarun    Chennai     17000.0
7     1008   Rittik   Durgapur     45000.0
8     1009    Barun  Hyderabad     39000.0
9     1010    Utpal    Lucknow     20000.0
10    1011    Rohit      Noida     35000.0
11    1012  Chandan     Gujrat     45000.0
12    1013     Sima    Kolkata     42000.0

In [41]:
# Class Assignment - 5
# Delete all the employees from the city 'Kolkata' and display the updated table
sqlStr = "DELETE FROM employee WHERE emp_city = 'Kolkata';"
table = connection.execute(sqlStr)
connection.commit()
print ("So the number of the records got deleted:", table.rowcount)

So the number of the records got deleted: 3

In [42]:
# retrieving records from the database table
# SQL for fetching all the records from the employee table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}...")

Emp-ID: 1003, Emp-Name: Subham, Emp-City: Mumbai, Emp-Salary: 36000.0...
Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 28000.0...
Emp-ID: 1005, Emp-Name: Kakali, Emp-City: Mumbai, Emp-Salary: 25000.0...
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0...
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 17000.0...
Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0...
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0...
Emp-ID: 1010, Emp-Name: Utpal, Emp-City: Lucknow, Emp-Salary: 20000.0...
Emp-ID: 1011, Emp-Name: Rohit, Emp-City: Noida, Emp-Salary: 35000.0...
Emp-ID: 1012, Emp-Name: Chandan, Emp-City: Gujrat, Emp-Salary: 45000.0...

In [44]:
# Class Assignment - 6
# Update salary to 30000 where city is 'Chennai' and display the updated table
sqlStr = "UPDATE employee SET emp_salary = 30000 WHERE emp_city = 'Chennai';"
table = connection.execute(sqlStr)
connection.commit()
print ("So the number of the records got updated:", table.rowcount)

So the number of the records got updated: 2

In [45]:
# retrieving records from the database table
# SQL for fetching all the records from the employee table
sqlStr = "SELECT * FROM employee;"
# read from table and point the cursor into the variable cur_table
cur_table = connection.execute(sqlStr)
for row in cur_table:
    print(f"Emp-ID: {row[0]}, Emp-Name: {row[1]}, Emp-City: {row[2]}, Emp-Salary: {row[3]}...")

Emp-ID: 1003, Emp-Name: Subham, Emp-City: Mumbai, Emp-Salary: 36000.0...
Emp-ID: 1004, Emp-Name: Dinesh, Emp-City: Chennai, Emp-Salary: 30000.0...
Emp-ID: 1005, Emp-Name: Kakali, Emp-City: Mumbai, Emp-Salary: 25000.0...
Emp-ID: 1006, Emp-Name: Bimal, Emp-City: Hyderabad, Emp-Salary: 30000.0...
Emp-ID: 1007, Emp-Name: Tarun, Emp-City: Chennai, Emp-Salary: 30000.0...
Emp-ID: 1008, Emp-Name: Rittik, Emp-City: Durgapur, Emp-Salary: 45000.0...
Emp-ID: 1009, Emp-Name: Barun, Emp-City: Hyderabad, Emp-Salary: 39000.0...
Emp-ID: 1010, Emp-Name: Utpal, Emp-City: Lucknow, Emp-Salary: 20000.0...
Emp-ID: 1011, Emp-Name: Rohit, Emp-City: Noida, Emp-Salary: 35000.0...
Emp-ID: 1012, Emp-Name: Chandan, Emp-City: Gujrat, Emp-Salary: 45000.0...

In [47]:
# closing the database connection
connection.close()